[
  {
    "name": "Ryan Shackleford",
    "role": "President",
    "photo": "/images/board-members/ryan.avif",
    "bio": "Ryan grew up in South Boise and jumped at the opportunity to return four years ago. Having completed medical training and worked in big cities in family medicine and psychiatry, it was always his intent to return to his roots and to set up a practice near his parents and sibling. He remembers an idyllic childhood roaming the neighborhoods of Southeast Boise and wants to re-create the same for his children.\n\nA lot changed in the intervening decades. Being a child, parent, and/or grandparent has never been more difficult. Being connected to each other has never been more difficult. Many feel isolated, stressed out, frustrated and depressed. Ryan is committed to contributing to his local community with skills developed educating and providing interventions for emotional health and well-being.\n\nHe works in a Federally Qualified Health Center in town, providing care to those with poor access to behavioral health services. He also teaches resident physicians in family medicine and psychiatry how to provide excellent care. Finally, he owns a small, private psychotherapy practice on the bench which specializes in intensive short-term psychotherapy and medication-assisted psychotherapy (psychedelics, the wave of the future!).\n\nRyan participates in the Idaho State Behavioral Health Planning Committee and in research through the Family Medicine Residency of Idaho, in addition to a few other local projects dear to his heart. He’s a member of the Garfield Elementary School PTO where both of his children go to school, and where his sister teaches. Ryan believes a strong public education system is the only way to sustain a healthy, happy, and equitable community.\n\nRyan credits his amazing wife, Rhiana, with the idea and implementation of the new Garfield Walking Path, but don’t be fooled. Ryan contributed also. Serving on the SBV Board is an important project representing a diverse and inclusive community."
  },
  {
    "name": "Tom Larson",
    "role": "Vice President",
    "photo": "/images/board-members/tom.avif",
    "bio": "Tom Larson is originally from Montana and met his Boise native wife, Cecelia, while both were working at Boeing in Seattle. Tom and Cecelia moved to Boise in 2000, in order to raise their two children in a smaller town. They moved into their current house on Manitou in August of 2000 and have lived here ever since. Tom is a retired mechanical engineer who worked in the locomotive business after moving to Boise.\n\nTom's main goal is to be mindful of all the great things about our neighborhood and Boise that drew us here in the first place, while the city and neighborhood grow and change."
  },
  {
    "name": "Tyler King",
    "role": "Secretary",
    "photo": "/images/board-members/tyler.avif",
    "bio": "Tyler and his wife Justine moved to the neighborhood from farther west in Boise in 2020 and have been enthralled with the neighborhood ever since. Together, they are renovating a home on Manitou Avenue, developing a garden plot, and rearing a flock of chickens.\n\nTyler volunteered for the neighborhood association board with the hope of building an inclusive community and advocating for city resources to support the neighborhood we call home. Tyler is a research hydrologist with the U.S. Geological Survey, a member of the graduate faculty at Boise State University, and an alum of the University of New Hampshire, the Norwegian Institute of Science and Technology, the Fulbright scholar program, and Utah State University.\n\nWhen not in the neighborhood, Tyler and Justine can be found running and biking in Boise foothills, rafting Idaho's rivers, or skiing Idaho's backcountry peaks."
  },
  {
    "name": "Jocelyn Plass",
    "role": "Treasurer",
    "photo": "/images/board-members/jocelyn.avif",
    "bio": "Jocelyn and her family divide their time between beautiful Stanley and gorgeous South Boise Village. Jocelyn is a Realtor and her spouse is an attorney. In her spare time she enjoys gardening, skiing, playing pond hockey while in Stanley and women's recreation league hockey in Boise and making delicious confections and baked goods. The family enjoys hiking, swimming, cooking, traveling, hanging out and working on their home.\n\nIf you see her out in her amazing Dahlia garden or walking the neighborhood with the RescuePets (Belle and Ladybird) please say hello."
  },
  {
    "name": "Kathryn Fahey",
    "role": "Housing & Development Committee Chair",
    "photo": "/images/board-members/kathyrn.avif",
    "bio": "Kathryn has lived in Idaho since 1974, and in South East Boise since 1976, while she was attending Boise State University. In 1977 Kathryn began working for Morrison-Knudsen which was located on Broadway. Staying in SE Boise just worked out for her. She enjoyed riding her bicycle to work for the next 38 years.\n\nNow Kathryn can't imagine living anywhere else. She loves this part of town. “We are close to parks, the zoo, the museums, downtown, the greenbelt and the airport. It's the best place to be. We are lucky that this neighborhood still has a small town vibe.”\n\nKathryn’s goals for this neighborhood are to keep its cozy, friendly atmosphere while being mindful of the encroaching university."
  },
  {
    "name": "Lisa Kusnierz",
    "role": "Director- Past President",
    "photo": "/images/board-members/lisa.avif",
    "bio": "Lisa is originally from Virginia, and lived in Maine and the Upper Peninsula of Michigan before making her way west. She relocated to Boise in late 2016 after living in Montana for 10 years. She and her husband have two young kids and can often be seen walking or biking around the neighborhood, or playing at Manitou Park. She enjoys the sense of community in South Boise Village, as well as its proximity to downtown and other amenities.\n\nLisa is excited to join the board and work to make the neighborhood an even better place to live."
  },
  {
    "name": "Tony Ching",
    "role": "Director",
    "photo": "/images/board-members/tony.avif",
    "bio": "Tony was born in Burma and grew up in San Francisco. In 2018, Tony and his wife Kerry went to China to teach English to children. They came back to the U.S. in early 2020 because of the Pandemic. While experiencing van life during visits to National Parks, they stopped in Boise to see a childhood friend and a former colleague. After having lived in big cities and visiting many countries, they fell in love with the city of trees, appreciating its small-town vibe, and relocated soon after.\n\nTony and Kerry first lived in the East End and moved to the South Boise Village neighborhood in 2022. Tony, Kerry, and their rescued red heeler Buddy Boo-Boo enjoy walking around the neighborhood, making friends, and exploring its hidden gems.\n\nTony's goals are for the neighborhood to be welcoming, safe and friendly, preserving its sense of community."
  },
  {
    "name": "Damiana Uberuaga",
    "role": "Director",
    "photo": "/images/board-members/damiana.avif",
    "bio": "My name is Damiana Uberuaga and I lived in this same neighborhood when I was a little girl at Garfield school. Many journeys since that time. I retired six years ago from a thriving private practice in downtown Boise. I now have time for my art work and travel. I've lived in my same house on Manitou for 33 years and I have no intentions of moving. This is the best neighborhood ever!"
  },
  {
    "name": "Karen Drummey",
    "role": "Director",
    "photo": "/images/board-members/karen.avif",
    "bio": "My name is Karen Drummey. My husband, Ken Wipff and I bought our house on Garfield Street in 2020, and after extensive renovations, moved up here permanently the end of 2021. However, our ties to this neighborhood go back to 2012 when our daughter was attending BSU and we bought a house on Michigan Street. I’ve always enjoyed the energy of this neighborhood—children riding bikes, people out walking, with or without a dog or two.\n\nI want to help preserve this uniqueness and keep this such an enjoyable place to live."
  }
]
